Project/Toir.Adaptation/src/Catalogs/торо_ИдентификаторыТехКарт/торо_ИдентификаторыТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ИдентификаторыТехКарт</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>гкс_Владелец</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4380d8c9-cbf4-44cf-b7c9-1da41ff5be61">
    <name>гкс_Обслуживание</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="67f4d7dd-7bf2-4031-a04a-7940d981637a">
    <name>гкс_Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

Project/Toir.Adaptation/src/InformationRegisters/торо_ВерсииТехКарт/торо_ВерсииТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВерсииТехКарт</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ТехКарта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ИдентификаторТехКарты</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Enums/торо_СтатусыНормативныхРемонтовИТехКарт/торо_СтатусыНормативныхРемонтовИТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_СтатусыНормативныхРемонтовИТехКарт</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="670db8b6-a1e6-4c96-bfe5-81ae11f212c2">
    <name>ВРазработке</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="14134500-fdf0-48e5-83c2-3f92aba5cf2f">
    <name>Действует</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3e8d26ed-f54a-46c4-8e61-6040f607ae89">
    <name>Закрыта</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/Catalogs/торо_ТехКарты/торо_ТехКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ТехКарты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>НормаВремениТекст</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СодержитОпасныеОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СодержитРаботыПовышеннойОпасности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяПростояТекст</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаПринятия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВыполнениеРемонтаТребуетОстановаОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидПростоя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="318cfb02-93d9-4e72-b18b-d94c75743551">
    <name>гкс_ШаблонОригинал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3596ff4d-323b-42dc-9670-b09c4c53eb1a">
    <name>гкс_ПериодДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c8b1bb05-348c-4004-a9c7-f4334bfd4798">
    <name>гкс_ДатаОкончанияАктуальности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cda9ddcc-962a-45a2-b3c3-e94d16217457">
    <name>гкс_КоличествоПериодовДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>СписокОпераций</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Операция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>11</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НормаВремениВСекундах</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>11</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="00e732b3-dcfc-4752-8d6d-92d8a2df1df3">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="fbc4c1a4-e43e-422b-b50e-564f58400e1c">
      <name>гкс_Примечание</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТрудовыеЗатраты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ВремяРаботы</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Операция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериальныеЗатраты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Операция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнструментыИТехника</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Операция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Инструмент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="b4f819bb-d0da-4bc8-9121-c57956d6248f">
    <name>ИзмеряемыеПоказатели</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="4723efe0-b00c-4604-ae16-cebdc894e7a4">
      <name>гкс_ТребуемыйРезультатИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="8c232819-8c55-4920-9838-1aa96476a92f">
    <name>гкс_ИспытанияОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="af1662b9-55f3-4d05-b29c-04399c6b9e0f">
      <name>ИспытаниеОборудования</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir.Adaptation/src/Catalogs/торо_ИдентификаторыТехКарт/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
&Перед("ПриСозданииНаСервере")
Процедура гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Гкс+[TOIR20-622] Оселедько В.С. от 25.07.2025. Добавлено:{
	Если Параметры.Свойство("ВремяНачалаОткрытияФормы") Тогда
		ВремяНачалаЗамера = Параметры.ВремяНачалаОткрытияФормы;	
	Иначе
		ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	КонецЕсли;
    // } Гкс-[TOIR20-622]
	ДобавитьНовыеЭлементы();
КонецПроцедуры

&НаКлиенте
&После("ПриОткрытии")
Процедура гкс_ПриОткрытии(Отказ)
	гкс_УстановитьДоступность(); 
	// Гкс+[TOIR20-622] Оселедько В.С. от 25.07.2025. Добавлено:{
	гкс_ПриОткрытииПослеНаСервере(ВремяНачалаЗамера);
	// } Гкс-[TOIR20-622]
КонецПроцедуры

// Гкс+[TOIR20-622] Оселедько В.С. от 25.07.2025. Добавлено:{
&НаСервереБезКонтекста
Процедура гкс_ПриОткрытииПослеНаСервере(ВремяНачалаЗамера)
	ЗавершитьЗамерОткрытияФормы(ВремяНачалаЗамера);	
КонецПроцедуры // } Гкс-[TOIR20-622]

&НаСервере
&После("ПослеЗаписиНаСервере")
Процедура гкс_ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
    // гкс+ [12.22] Деснол 13.12.2022
	//Если ЗначениеЗаполнено(Объект.Родитель) Тогда 
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	Родитель1.Родитель КАК Родитель,
	//		|	Родитель1.Ссылка КАК Ссылка
	//		|ИЗ
	//		|	Справочник.торо_ИдентификаторыТехКарт КАК торо_ИдентификаторыТехКарт
	//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ИдентификаторыТехКарт КАК Родитель1
	//		|		ПО торо_ИдентификаторыТехКарт.Родитель = Родитель1.Ссылка
	//		|ГДЕ
	//		|	торо_ИдентификаторыТехКарт.Ссылка = &Ссылка";
	//	
	//	Запрос.УстановитьПараметр("Ссылка", Объект.Родитель);
	//	РезультатЗапроса = Запрос.Выполнить();
	//	Если РезультатЗапроса.Пустой() = Ложь Тогда 
	//		Выборка = РезультатЗапроса.Выбрать();
	//		Выборка.Следующий();
	//		Если Выборка.Родитель = Справочники.торо_ИдентификаторыТехКарт.ПустаяСсылка() Тогда 
	//			ЭтотОбъект["гкс_ЭтоРодитель"] = Истина;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	//Если ЭтотОбъект["гкс_ЭтоРодитель"] = Истина И ЗначениеЗаполнено(ТехКарта.ДатаПринятия)
	//	И ЭтотОбъект["гкс_ИзменитьТекущуюВерсию"] = Истина Тогда 
	//	
	//	Если Объект.Статус = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.Действует Тогда 
	//		
	//	Событие = Константы.гкс_ПараметрыОповещенияОИзмененииТехКарты.Получить();
	//	
	//		Запрос = Новый Запрос;
	//		Запрос.Текст = 
	//			"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//			|	гкс_ИерархияТехКарт.Подчиненный КАК Подчиненный,
	//			|	гкс_ИерархияТехКарт.Подчиненный.Родитель КАК Родитель,
	//			|	гкс_ИерархияТехКарт.Подчиненный.гкс_Обслуживание КАК гкс_Обслуживание
	//			|ПОМЕСТИТЬ НужныеПодчиненные
	//			|ИЗ
	//			|	РегистрСведений.гкс_ИерархияТехКарт КАК гкс_ИерархияТехКарт
	//			|ГДЕ
	//			|	гкс_ИерархияТехКарт.Родитель = &Ссылка
	//			|;
	//			|
	//			|////////////////////////////////////////////////////////////////////////////////
	//			|ВЫБРАТЬ
	//			|	гкс_ИерархияТехКарт.Подчиненный КАК Подчиненный,
	//			|	гкс_ИерархияТехКарт.Родитель КАК Родитель,
	//			|	ПоследняяВерсия.ТехКарта КАК ТехКарта,
	//			|	гкс_ИерархияТехКарт.гкс_Обслуживание КАК гкс_Обслуживание,
	//			|	ПоискОригинала.ТехКарта ЕСТЬ NULL КАК ЭтоНовый
	//			|ИЗ
	//			|	НужныеПодчиненные КАК гкс_ИерархияТехКарт
	//			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт.СрезПоследних(
	//			|				,
	//			|				ИдентификаторТехКарты В
	//			|					(ВЫБРАТЬ
	//			|						ТЧ.Подчиненный
	//			|					ИЗ
	//			|						НужныеПодчиненные КАК ТЧ)) КАК ПоследняяВерсия
	//			|		ПО гкс_ИерархияТехКарт.Подчиненный = ПоследняяВерсия.ИдентификаторТехКарты
	//			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт.СрезПоследних(
	//			|				,
	//			|				ИдентификаторТехКарты В
	//			|						(ВЫБРАТЬ
	//			|							ТЧ.Подчиненный
	//			|						ИЗ
	//			|							НужныеПодчиненные КАК ТЧ)
	//			|					И ТехКарта.гкс_ШаблонОригинал = &Оригинал) КАК ПоискОригинала
	//			|		ПО гкс_ИерархияТехКарт.Подчиненный = ПоискОригинала.ИдентификаторТехКарты
	//			|
	//			|	";
	//		
	//		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	//		Запрос.УстановитьПараметр("Оригинал", ТехКарта.Ссылка);
	//		РезультатЗапроса = Запрос.Выполнить();
	//		Если РезультатЗапроса.Пустой() = Ложь Тогда
	//			// Гкс+[TOIR20-170] Селимов от 16.11.2020. Добавлено:{
	//			ОповещаемыеПользователи = Новый Соответствие; // } Гкс-[TOIR20-170] 
	//			Выборка = РезультатЗапроса.Выбрать();
	//			Пока Выборка.Следующий() Цикл
	//				Если Выборка.ЭтоНовый = Истина Тогда 
	//					гкс_ПолноеИзменение = Ложь;
	//					Если ЗначениеЗаполнено(Выборка.ТехКарта) Тогда 
	//						НовыйОбъект = Выборка.ТехКарта.Скопировать();
	//						Если Не ТехКарта.СписокОпераций.Количество() = НовыйОбъект.СписокОпераций.Количество()
	//							ИЛИ НЕ Объект.гкс_Обслуживание = Выборка.гкс_Обслуживание Тогда 
	//							гкс_ПолноеИзменение = Истина;
	//						Иначе
	//							Для Сч = 0 По ТехКарта.СписокОпераций.Количество() - 1 Цикл
	//								Если не (ТехКарта.СписокОпераций[Сч].Операция = НовыйОбъект.СписокОпераций[Сч].Операция
	//									И ТехКарта.СписокОпераций[Сч].СпособВыполнения = НовыйОбъект.СписокОпераций[Сч].СпособВыполнения
	//									И ТехКарта.СписокОпераций[Сч].Количество = НовыйОбъект.СписокОпераций[Сч].Количество) Тогда 
	//									гкс_ПолноеИзменение = Истина;
	//									Прервать;
	//								КонецЕсли;
	//							КонецЦикла;
	//						КонецЕсли;
	//					Иначе
	//						НовыйОбъект = ТехКарта.Ссылка.Скопировать();
	//					КонецЕсли;
	//					НовыйОбъект.ДатаПринятия = ТехКарта.ДатаПринятия;
	//					НовыйОбъект.гкс_ШаблонОригинал = ТехКарта.Ссылка;
	//					НовыйОбъект.Записать();
	//					
	//					НаборЗаписей = РегистрыСведений.торо_ВерсииТехКарт.СоздатьНаборЗаписей();
	//					НаборЗаписей.Отбор.ИдентификаторТехКарты.Установить(Выборка.Подчиненный);
	//					НаборЗаписей.Отбор.Период.Установить(НовыйОбъект.ДатаПринятия);
	//					НоваяСтрока = НаборЗаписей.Добавить();
	//					НоваяСтрока.ИдентификаторТехКарты = Выборка.Подчиненный;
	//					НоваяСтрока.ТехКарта = НовыйОбъект.Ссылка;
	//					НоваяСтрока.Период = НовыйОбъект.ДатаПринятия;
	//					НаборЗаписей.Записать();
	//					
	//					ОбъектИТК = Выборка.Подчиненный.ПолучитьОбъект();
	//					ОбъектИТК.Наименование = Строка(Объект.гкс_Обслуживание) + " " + ОбъектИТК.Родитель;
	//					ОбъектИТК.гкс_Обслуживание = Объект.гкс_Обслуживание;
	//					// Гкс+[TOIR20-170] Селимов от 17.11.2020. Изменено:{
	//					// НужноСменитьСтатус = Ложь;
	//					// }На:{
	//					НужноСменитьСтатус = ОбъектИТК.Статус = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.ВРазработке;
	//					// } Гкс-[TOIR20-170]
	//					Если гкс_ПолноеИзменение = Истина Тогда 
	//						// Гкс+[TOIR20-170] Селимов от 17.11.2020. Удалено:{
	//						// НужноСменитьСтатус = Не ОбъектИТК.Статус = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.ВРазработке;
	//						// } Гкс-[TOIR20-170]  
	//						ОбъектИТК.Статус = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.ВРазработке;
	//						
	//						ИзменитьПодчиненнуюВерсиюТК(НовыйОбъект,);
	//					КонецЕсли;
	//					ОбъектИТК.Записать();
	//					// Гкс+[TOIR20-170] Селимов от 16.11.2020. Удалено:{
	//					//Если НужноСменитьСтатус И ЗначениеЗаполнено(ОбъектИТК.гкс_Ответственный)
	//					//	И ЗначениеЗаполнено(Событие) Тогда 
	//					//	СтруктураДанных = Новый Структура("Ссылка,Ответственный,ВидДокумента,Наименование",
	//					//		ОбъектИТК.Ссылка, ОбъектИТК.гкс_Ответственный, "", ОбъектИТК.Наименование);
	//					//	торо_РаботаСУведомлениями.ЗаписатьУведомленияФМ(СтруктураДанных,Событие);
	//					//КонецЕсли;
	//					// } Гкс-[TOIR20-170]  
	//					
	//				Иначе
	//					ИзменитьПодчиненнуюВерсиюТК(, Выборка.ТехКарта);
	//					
	//					ОбъектИТК = Выборка.Подчиненный.ПолучитьОбъект();
	//					ОбъектИТК.Наименование = Строка(Объект.гкс_Обслуживание) + " " + ОбъектИТК.Родитель;
	//					ОбъектИТК.гкс_Обслуживание = Объект.гкс_Обслуживание;
	//					// Гкс+[TOIR20-170] Селимов от 16.11.2020. Изменено:{
	//					// НужноСменитьСтатус = Не ОбъектИТК.Статус = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.ВРазработке;
	//					// }На:{
	//					НужноСменитьСтатус = ОбъектИТК.Статус = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.ВРазработке;
	//					// } Гкс-[TOIR20-170]
	//					ОбъектИТК.Статус = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.ВРазработке;
	//					ОбъектИТК.Записать();
	//					
	//					// Гкс+[TOIR20-170] Селимов от 16.11.2020. Добавлено:{
	//					//Если НужноСменитьСтатус И ЗначениеЗаполнено(ОбъектИТК.гкс_Ответственный)
	//					//	И ЗначениеЗаполнено(Событие) Тогда 
	//					//	СтруктураДанных = Новый Структура("Ссылка,Ответственный,ВидДокумента,Наименование",
	//					//		ОбъектИТК.Ссылка, ОбъектИТК.гкс_Ответственный, "", ОбъектИТК.Наименование);
	//					//	торо_РаботаСУведомлениями.ЗаписатьУведомленияФМ(СтруктураДанных);
	//					//КонецЕсли;
	//					// } Гкс-[TOIR20-170] 
	//				КонецЕсли;
	//				// Гкс+[TOIR20-170] Селимов от 16.11.2020. Добавлено:{
	//				Если НужноСменитьСтатус И ЗначениеЗаполнено(ОбъектИТК.гкс_Ответственный)
	//					И ЗначениеЗаполнено(Событие) Тогда 
	//					Если ОповещаемыеПользователи.Получить(ОбъектИТК.гкс_Ответственный) = Неопределено Тогда
	//					ОповещаемыеПользователи.Вставить(ОбъектИТК.гкс_Ответственный, "- " + СокрЛП(ОбъектИТК.Наименование));
	//					Иначе
	//						ИзмененныеТехКарты = ОповещаемыеПользователи[ОбъектИТК.гкс_Ответственный];
	//						ОповещаемыеПользователи[ОбъектИТК.гкс_Ответственный] = ОповещаемыеПользователи[ОбъектИТК.гкс_Ответственный] 
	//																			 + Символы.ПС + "- " + СокрЛП(ОбъектИТК.Наименование);
	//					КонецЕсли; 
	//				КонецЕсли; // } Гкс-[TOIR20-170] 
	//			КонецЦикла;
	//			// Гкс+[TOIR20-170] Селимов от 16.11.2020. Удалено:{
	//			Если НужноСменитьСтатус И ЗначениеЗаполнено(ОбъектИТК.гкс_Ответственный)
	//				И ЗначениеЗаполнено(Событие) Тогда 
	//				СтруктураДанных = Новый Структура;
	//				СтруктураДанных.Вставить("Ссылка", ОбъектИТК.Ссылка); 				
	//				СтруктураДанных.Вставить("Ответственный", ОбъектИТК.гкс_Ответственный); 				
	//				СтруктураДанных.Вставить("ВидДокумента", ""); 				
	//				СтруктураДанных.Вставить("Наименование", ОбъектИТК.Наименование); 				
	//				СтруктураДанных.Вставить("ОповещаемыеПользователи", ОповещаемыеПользователи); 	
	//				СтруктураДанных.Вставить("АвторИзменений", Пользователи.ТекущийПользователь());
	//				торо_РаботаСУведомлениями.ЗаписатьУведомленияТК(СтруктураДанных, Событие);
	//			КонецЕсли; // } Гкс-[TOIR20-170] 
	//		КонецЕсли;
	//		
	//		Запрос = Новый Запрос;
	//		Запрос.Текст = 
	//			"ВЫБРАТЬ
	//			|	гкс_ИерархияТехКарт.Подчиненный КАК Подчиненный,
	//			|	гкс_ИерархияТехКарт.Подчиненный.Родитель КАК Родитель
	//			|ПОМЕСТИТЬ Существующие
	//			|ИЗ
	//			|	РегистрСведений.гкс_ИерархияТехКарт КАК гкс_ИерархияТехКарт
	//			|ГДЕ
	//			|	гкс_ИерархияТехКарт.Родитель = &Ссылка
	//			|;
	//			|
	//			|////////////////////////////////////////////////////////////////////////////////
	//			|ВЫБРАТЬ
	//			|	торо_ИдентификаторыТехКарт.Ссылка КАК Ссылка
	//			|ПОМЕСТИТЬ ВсеПОдчиненныеРодители
	//			|ИЗ
	//			|	Справочник.торо_ИдентификаторыТехКарт КАК торо_ИдентификаторыТехКарт
	//			|ГДЕ
	//			|	торо_ИдентификаторыТехКарт.Родитель = &Родитель
	//			|	И торо_ИдентификаторыТехКарт.ЭтоГруппа = ИСТИНА
	//			|;
	//			|
	//			|////////////////////////////////////////////////////////////////////////////////
	//			|ВЫБРАТЬ
	//			|	ВсеПОдчиненныеРодители.Ссылка КАК Ссылка
	//			|ИЗ
	//			|	ВсеПОдчиненныеРодители КАК ВсеПОдчиненныеРодители
	//			|		ЛЕВОЕ СОЕДИНЕНИЕ Существующие КАК Существующие
	//			|		ПО ВсеПОдчиненныеРодители.Ссылка = Существующие.Родитель
	//			|ГДЕ
	//			|	Существующие.Подчиненный ЕСТЬ NULL";
	//		
	//		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	//		Запрос.УстановитьПараметр("Родитель", Объект.Родитель);
	//		РезультатЗапроса = Запрос.Выполнить();
	//		Если РезультатЗапроса.Пустой() = Ложь Тогда
	//			Выборка = РезультатЗапроса.Выбрать();
	//			Пока Выборка.Следующий() Цикл
	//				НовыйОбъект = ТехКарта.Ссылка.Скопировать();
	//				НовыйОбъект.гкс_ШаблонОригинал = ТехКарта.Ссылка;
	//				НовыйОбъект.Записать();
	//				
	//				НовыйИТК = Справочники.торо_ИдентификаторыТехКарт.СоздатьЭлемент();
	//				НовыйИТК.Наименование = Строка(Объект.гкс_Обслуживание) + " " + Выборка.Ссылка;
	//				НовыйИТК.гкс_Обслуживание = Объект.гкс_Обслуживание;
	//				НовыйИТК.Родитель = Выборка.Ссылка;
	//				НовыйИТК.Статус = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.ВРазработке;
	//				НовыйИТК.гкс_Ответственный = Объект.гкс_Ответственный;
	//				НовыйИТК.Записать();
	//				
	//				НаборЗаписей = РегистрыСведений.торо_ВерсииТехКарт.СоздатьНаборЗаписей();
	//				НаборЗаписей.Отбор.ИдентификаторТехКарты.Установить(НовыйИТК.Ссылка);
	//				НаборЗаписей.Отбор.Период.Установить(НовыйОбъект.ДатаПринятия);
	//				НоваяСтрока = НаборЗаписей.Добавить();
	//				НоваяСтрока.ИдентификаторТехКарты = НовыйИТК.Ссылка;
	//				НоваяСтрока.ТехКарта = НовыйОбъект.Ссылка;
	//				НоваяСтрока.Период = НовыйОбъект.ДатаПринятия;
	//				НаборЗаписей.Записать();
	//				
	//				НаборЗаписей = РегистрыСведений.гкс_ИерархияТехКарт.СоздатьНаборЗаписей();
	//				НаборЗаписей.Отбор.Подчиненный.Установить(НовыйИТК.Ссылка);
	//				НоваяСтрока = НаборЗаписей.Добавить();
	//				НоваяСтрока.Подчиненный = НовыйИТК.Ссылка;
	//				НоваяСтрока.Родитель = Объект.Ссылка;
	//				НаборЗаписей.Записать();
	//			КонецЦикла;
	//		КонецЕсли;
	//	КонецЕсли;
	//	ЭтотОбъект["гкс_ИзменитьТекущуюВерсию"] = Ложь;
	//КонецЕсли;
	// гкс- [12.22] Деснол 13.12.2022
КонецПроцедуры

&НаКлиенте
Процедура гкс_ПослеЗаписиПосле(ПараметрыЗаписи)
	Оповестить("ИзмененИТК");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Гкс+[TOIR20-194] Селимов от 17.11.2020. Добавлено:{
&НаКлиенте
Процедура гкс_ПериодДействияПриИзменении(Элемент)
	
	РассчитатьДатуОкончанияАктуальностиКарты();	
	
КонецПроцедуры // } Гкс-[TOIR20-194] 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериальныеЗатраты
// Гкс+[TOIR20-503] Зозуля А.В. от 13.01.2025. Добавлено:{
&НаКлиенте
Процедура гкс_ИспытанияОборудованияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ПроверкаВозможностиВводаНормативов(Отказ);	
КонецПроцедуры	// } Гкс-[TOIR20-503] Зозуля А.В. от 13.01.2025.

// Гкс+[TOIR20-503] Зозуля А.В. от 13.01.2025. Добавлено:{
&НаКлиенте
Процедура гкс_ИспытанияОборудованияПередНачаломИзменения(Элемент, Отказ)
	ПроверкаВозможностиВводаНормативов(Отказ);
КонецПроцедуры	// } Гкс-[TOIR20-503] Зозуля А.В. от 13.01.2025.

// Гкс+[TOIR20-503] Зозуля А.В. от 13.01.2025. Добавлено:{
&НаКлиенте
Процедура гкс_ИспытанияОборудованияПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элементы.гкс_ИспытанияОборудования.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда 
		
		Если НЕ ПроверитьВозможностьУдаления(ТекДанные) Тогда 
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		ТекДанныеОперация = Элементы.СписокОпераций.ТекущиеДанные;
		Если НЕ ТекДанныеОперация = Неопределено Тогда
			Если ТипЗнч(ТекДанныеОперация.Операция) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
				МассивСтрок = ЭтотОбъект["тзгкс_ИспытанияОборудования"].НайтиСтроки(Новый Структура("ID, ИспытаниеОборудования",
					ТекДанные.ID, ТекДанные.ИспытаниеОборудования));
				Для каждого Элем Из МассивСтрок Цикл
					ЭтотОбъект["тзгкс_ИспытанияОборудования"].Удалить(Элем);
				КонецЦикла;
			Иначе
				МассивСтрок = ТехКарта.гкс_ИспытанияОборудования.НайтиСтроки(Новый Структура("ID, ИспытаниеОборудования",
					ТекДанные.ID, ТекДанные.ИспытаниеОборудования));
				Для каждого Элем Из МассивСтрок Цикл
					ТехКарта.гкс_ИспытанияОборудования.Удалить(Элем);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры	// } Гкс-[TOIR20-503] Зозуля А.В. от 13.01.2025.

// Гкс+[TOIR20-503] Зозуля А.В. от 13.01.2025. Добавлено:{
&НаКлиенте
Процедура гкс_ИспытанияОборудованияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ЗаполнитьIDРодителяИОперациюСтрокиТабличнойчасти(Элементы.гкс_ИспытанияОборудования.ТекущиеДанные);		
	Иначе
		// Запись данных до редактирования
		торо_СобытияФормКлиент.ПриНачалеРедактирования(Элемент,СтруктураДанныхДоРедактирования,Элемент.ТекущиеДанные);
	КонецЕсли;
	
	Модифицированность = Истина; 
	
КонецПроцедуры	// } Гкс-[TOIR20-503] Зозуля А.В. от 13.01.2025.

// Гкс+[TOIR20-503] Зозуля А.В. от 13.01.2025. Добавлено:{
&НаКлиенте
Процедура гкс_ИспытанияОборудованияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элементы.гкс_ИспытанияОборудования.ТекущиеДанные;
	Если НЕ ОтменаРедактирования Тогда
		Если НЕ ТекДанные = Неопределено Тогда
			МассивСтрок = ЭтотОбъект.гкс_ИспытанияОборудования.НайтиСтроки(Новый Структура("ID, ИспытаниеОборудования",
				ТекДанные.ID, ТекДанные.ИспытаниеОборудования));
			Если МассивСтрок.Количество() > 1 Тогда
				ТекстСообщения = НСтр("es='¡Esta prueba de equipo ya ha sido agregada!';
										|ru='Данное испытание оборудования уже добавлено!';
										|en='This equipment test has already been added!'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Не НоваяСтрока Тогда
		// возврат старых значений
		ЗаполнитьЗначенияСвойств(ТекДанные,СтруктураДанныхДоРедактирования[Элемент.Имя]);
	КонецЕсли;
	
КонецПроцедуры	// } Гкс-[TOIR20-503] Зозуля А.В. от 13.01.2025.

// Гкс+[TOIR20-503] Зозуля А.В. от 13.01.2025. Добавлено:{
&НаКлиенте
Процедура гкс_ИспытанияОборудованияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекДанные = Элементы.гкс_ИспытанияОборудования.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		Если Не ЗначениеЗаполнено(ТекДанные.ИспытаниеОборудования) Тогда
			ЭтотОбъект.гкс_ИспытанияОборудования.Удалить(ЭтотОбъект.гкс_ИспытанияОборудования.Индекс(ТекДанные));
			Возврат;
		КонецЕсли; 
	Иначе
		Возврат;
	КонецЕсли; 
	
	Если НЕ ОтменаРедактирования Тогда
		Если НоваяСтрока Тогда
			НС = ТехКарта.гкс_ИспытанияОборудования.Добавить();
			ЗаполнитьЗначенияСвойств(НС, ТекДанные);
		Иначе
			ДанныеДоРедактирования = СтруктураДанныхДоРедактирования[Элемент.Имя];
			МассивСтрок = ТехКарта.гкс_ИспытанияОборудования.НайтиСтроки(Новый Структура("ID, ИспытаниеОборудования", 
				ТекДанные.ID, ДанныеДоРедактирования.ИспытаниеОборудования));
			Для каждого Элем Из МассивСтрок Цикл
				ЗаполнитьЗначенияСвойств(Элем, ТекДанные);
			КонецЦикла; 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	// } Гкс-[TOIR20-503] Зозуля А.В. от 13.01.2025.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ДобавитьНовыеЭлементы()
	МассивРеквизитов = Новый Массив();
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_СоздатьНовуюВерсию", Новый ОписаниеТипов("Булево")));  
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ЭтоРодитель", Новый ОписаниеТипов("Булево")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ЭтоНаследник", Новый ОписаниеТипов("Булево")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ИзменитьТекущуюВерсию", Новый ОписаниеТипов("Булево")));   
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_СтатусДляЗаписи", 
		Новый ОписаниеТипов("ПеречислениеСсылка.торо_СтатусыНормативныхРемонтовИТехКарт")));
	// Гкс+[TOIR20-503] Зозуля А.В. от 13.01.2025. Добавлено:{
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ТребуемыйРезультатИзмерения", 
		ОбщегоНазначения.ОписаниеТипаЧисло(15, 4), "ИзмеряемыеПоказатели", НСтр("ru='Требуемый результат измерения'"))); 
		
    МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ИспытанияОборудования", Новый ОписаниеТипов("ТаблицаЗначений")));    
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ID", ОбщегоНазначения.ОписаниеТипаСтрока(36), "гкс_ИспытанияОборудования", НСтр("ru='ID'")));	
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Операция", 
		Новый ОписаниеТипов("СправочникСсылка.торо_ТехнологическиеОперации"), "гкс_ИспытанияОборудования", НСтр("ru='Операция'")));	 
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ИспытаниеОборудования", 
		Новый ОписаниеТипов("СправочникСсылка.гкс_ИспытанияОборудования"), "гкс_ИспытанияОборудования", НСтр("ru='Испытание оборудования'"))); 	
	// } Гкс-[TOIR20-503] Зозуля А.В. от 13.01.2025.
	
	// Гкс+[TOIR20-545] Зозуля А.В. от 24.02.2025. Добавлено:{
    МассивРеквизитов.Добавить(Новый РеквизитФормы("тзгкс_ИспытанияОборудования", Новый ОписаниеТипов("ТаблицаЗначений")));    
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ID", ОбщегоНазначения.ОписаниеТипаСтрока(36), "тзгкс_ИспытанияОборудования", НСтр("ru='ID'")));	
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Операция", 
		Новый ОписаниеТипов("СправочникСсылка.торо_ТехнологическиеОперации"), "тзгкс_ИспытанияОборудования", НСтр("ru='Операция'")));	 
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ИспытаниеОборудования", 
		Новый ОписаниеТипов("СправочникСсылка.гкс_ИспытанияОборудования"), "тзгкс_ИспытанияОборудования", НСтр("ru='Испытание оборудования'")));
	// } Гкс-[TOIR20-545] Зозуля А.В. от 24.02.2025.
	ИзменитьРеквизиты(МассивРеквизитов);                                        
	ЭтотОбъект["гкс_СтатусДляЗаписи"] = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.Действует;
	                                                                         
	Элементы.Наименование.ТолькоПросмотр = Истина;
	
	НЭлем = Элементы.Добавить("гкс_Группа_Обслуживание", Тип("ГруппаФормы"));
	НЭлем.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НЭлем.ОтображатьЗаголовок = Ложь;
	
	Элементы.Переместить(Элементы["гкс_Группа_Обслуживание"], ЭтаФорма,Элементы.Ссылка);
	
	НЭлем = Элементы.Добавить("гкс_Обслуживание", Тип("ПолеФормы"), Элементы["гкс_Группа_Обслуживание"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.гкс_Обслуживание";
	НЭлем.УстановитьДействие("ПриИзменении","ОбслуживаниеПриИзменении");
	
	НЭлем = Элементы.Добавить("гкс_Ответственный", Тип("ПолеФормы"));
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.гкс_Ответственный";
	НЭлем.АвтоМаксимальнаяШирина = Ложь;	
	
	НЭлем = Элементы.Добавить("СписокОперацийгкс_Примечание", Тип("ПолеФормы"), Элементы.СписокОпераций);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ТехКарта.СписокОпераций.гкс_Примечание";
	Элементы.Переместить(Элементы["СписокОперацийгкс_Примечание"], Элементы.СписокОпераций,
			Элементы.СписокОперацийПродолжительностьТекст);
			
	// Гкс+[TOIR20-194] Селимов от 17.11.2020. Добавлено:{
	НЭлем = Элементы.Добавить("гкс_ГруппаПродолжительность", Тип("ГруппаФормы"));
	НЭлем.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НЭлем.ОтображатьЗаголовок = Ложь;  	
	НЭлем.РастягиватьПоГоризонтали = Истина;
	Элементы["гкс_ГруппаПродолжительность"].Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Элементы.Переместить(Элементы["гкс_ГруппаПродолжительность"], ЭтаФорма,Элементы["ГруппаОстанова"]);       	
	
	НЭлем = Элементы.Добавить("гкс_КоличествоПериодовДействия", Тип("ПолеФормы"));
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ТехКарта.гкс_КоличествоПериодовДействия";  	
	НЭлем.Заголовок = НСтр("ru = 'Период действия тех карт';
	| en = 'Period of action tech card';
	| es = 'Período de tarjeta técnica de acción después'");
	НЭлем.УстановитьДействие("ПриИзменении","гкс_ПериодДействияПриИзменении");
	Элементы.Переместить(Элементы["гкс_КоличествоПериодовДействия"], Элементы.гкс_ГруппаПродолжительность); 
	
	НЭлем = Элементы.Добавить("гкс_ПериодДействия", Тип("ПолеФормы"));
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НЭлем.ПутьКДанным = "ТехКарта.гкс_ПериодДействия";  		
	НЭлем.УстановитьДействие("ПриИзменении","гкс_ПериодДействияПриИзменении");
	Элементы.Переместить(Элементы["гкс_ПериодДействия"], Элементы.гкс_ГруппаПродолжительность);   	
	
	НЭлем = Элементы.Добавить("гкс_ДатаОкончанияАктуальности", Тип("ПолеФормы"));
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ТехКарта.гкс_ДатаОкончанияАктуальности";  		
	НЭлем.Доступность = Ложь;
	НЭлем.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	Элементы.Переместить(Элементы["гкс_ДатаОкончанияАктуальности"], Элементы.гкс_ГруппаПродолжительность); // } Гкс-[TOIR20-194]
	// гкс+ [03.23] Деснол 21.03.2023
	НоваяКоманда = Команды.Добавить("гкс_ОбновитьИзОпераций");
	НоваяКоманда.Действие = "гкс_ОбновитьИзОпераций";
	НоваяКоманда.Заголовок = "Обновить из операций";
	//
	НоваяКнопка = Элементы.Добавить("гкс_ОбновитьИзОперацийКнопка", Тип("КнопкаФормы"), Элементы.СписокОперацийКоманднаяПанель);
	НоваяКнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НоваяКнопка.ИмяКоманды = "гкс_ОбновитьИзОпераций";
	// гкс- [03.23] Деснол 21.03.2023 
	
	// Гкс+[TOIR20-503] Зозуля А.В. от 13.01.2025. Добавлено:{
	НЭлем	= Элементы.Вставить("ИзмеряемыеПоказателиПоказательгкс_ТребуемыйРезультатИзмерения",
		Тип("ПолеФормы"), Элементы.ИзмеряемыеПоказатели);	
	НЭлем.Вид	= ВидПоляФормы.ПолеВвода; 
	НЭлем.ПутьКДанным	= "ИзмеряемыеПоказатели.гкс_ТребуемыйРезультатИзмерения";
	НЭлем.АвтоОтметкаНезаполненного = Истина;
	
	НЭлем = Элементы.Добавить("гкс_ГруппаИспытанияОборудования", Тип("ГруппаФормы"), Элементы.ТабЧасти);
	НЭлем.Вид = ВидГруппыФормы.Страница;
	НЭлем.Заголовок = "Испытания оборудования";
	Элементы.гкс_ГруппаИспытанияОборудования.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Элементы.Переместить(Элементы.гкс_ГруппаИспытанияОборудования, Элементы.ТабЧасти, Элементы.ГруппаФайлы);  
		
	НЭлем	= Элементы.Вставить("гкс_ИспытанияОборудования", Тип("ТаблицаФормы"), Элементы.гкс_ГруппаИспытанияОборудования);	
	НЭлем.ПутьКДанным = "гкс_ИспытанияОборудования";
	НЭлем.Отображение = ОтображениеТаблицы.Список;
	НЭлем.УстановитьДействие("ПередНачаломДобавления", "гкс_ИспытанияОборудованияПередНачаломДобавления"); 
	НЭлем.УстановитьДействие("ПередНачаломИзменения", "гкс_ИспытанияОборудованияПередНачаломИзменения"); 
	НЭлем.УстановитьДействие("ПередУдалением", "гкс_ИспытанияОборудованияПередУдалением"); 
	НЭлем.УстановитьДействие("ПриНачалеРедактирования", "гкс_ИспытанияОборудованияПриНачалеРедактирования"); 
	НЭлем.УстановитьДействие("ПередОкончаниемРедактирования", "гкс_ИспытанияОборудованияПередОкончаниемРедактирования"); 
	НЭлем.УстановитьДействие("ПриОкончанииРедактирования", "гкс_ИспытанияОборудованияПриОкончанииРедактирования"); 

	НЭлем  = Элементы.Вставить("гкс_ИспытанияОборудованияИспытаниеОборудования",
		Тип("ПолеФормы"), Элементы.гкс_ИспытанияОборудования);	
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;      
	НЭлем.ПутьКДанным = "гкс_ИспытанияОборудования.ИспытаниеОборудования";
	// } Гкс-[TOIR20-503] Зозуля А.В. от 13.01.2025.
	
КонецПроцедуры

&НаКлиенте
Процедура ОбслуживаниеПриИзменении(Команда)
	Объект.Наименование = Строка(Объект.гкс_Обслуживание) + " " + Строка(Объект.Родитель);
КонецПроцедуры

&НаСервере
&После("СоздатьНовуюВерсиюТехкарты")
Процедура гкс_СоздатьНовуюВерсиюТехкарты(Знач ЗаполнитьТаблицы, Знач ТехКартаОбъект, Знач Копирование)
	ЭтотОбъект["гкс_СоздатьНовуюВерсию"] = Истина;
КонецПроцедуры

&НаКлиенте
&После("УстановитьДоступностьОтСтатуса")
Процедура гкс_УстановитьДоступностьОтСтатуса()
	Элементы["СписокОперацийгкс_Примечание"].ТолькоПросмотр = ЭтотОбъект["гкс_СтатусДляЗаписи"] = Объект.Статус;
	
	гкс_УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура гкс_УстановитьДоступность()
	Элементы.Наименование.ТолькоПросмотр = Истина;
	Если ЭтотОбъект["гкс_ЭтоРодитель"] = Истина Тогда 
		Элементы.ТабЧасти.Видимость = Ложь;
		Элементы.ДобавитьТехКарту.Видимость = Ложь;
		Элементы.КонтекстноеМенюДобавитьТехКарту.Видимость = Ложь;
		Элементы.ТехКартаСпособРасчетаПродолжительности.Доступность = Ложь;
		Элементы.Перерассчитать.Доступность = Ложь;
		Элементы.СписокОперацийПродолжительностьТекст.Видимость = Ложь;
		Элементы.НормаВремени.Видимость = Ложь;
		Элементы.ТехКартаСпособРасчетаПродолжительности.Видимость = Ложь;
		Элементы.Декорация1.Видимость = Ложь;
		Элементы.Перерассчитать.Видимость = Ложь;
		Элементы.ГруппаОстанова.Видимость = Ложь;
	ИначеЕсли ЭтотОбъект["гкс_ЭтоНаследник"] = Истина Тогда 
		Элементы.СписокОпераций.ИзменятьПорядокСтрок = Ложь;
		Элементы.СписокОпераций.ИзменятьСоставСтрок = Ложь;
		Элементы.СписокОперацийКоманднаяПанель.Доступность = Ложь;
		Элементы.ТехКартаСписокОперацийОперация.ТолькоПросмотр = Истина;
		Элементы.СписокОперацийКоличество.ТолькоПросмотр = Истина;
		Элементы["СписокОперацийгкс_Примечание"].ТолькоПросмотр = Истина;
		Элементы.ТехКартаСписокОперацийСпособВыполнения.ТолькоПросмотр = Истина;
		Элементы.СоздатьНовуюВерсию.Доступность = Ложь;
		Элементы.ИзменитьДату.Доступность = Ложь;
		Элементы.НормаВремени.Видимость = Истина;
		Элементы.ТехКартаСпособРасчетаПродолжительности.Видимость = Истина;
		Элементы.Декорация1.Видимость = Истина;
		Элементы.Перерассчитать.Видимость = Истина;
		
		Элементы.ДобавитьТехКарту.Видимость = Ложь;
		Элементы.КонтекстноеМенюДобавитьТехКарту.Видимость = Ложь;
		Элементы.Родитель.ТолькоПросмотр = Истина;
		Элементы["гкс_Обслуживание"].ТолькоПросмотр = Истина;
		Элементы.ТехКартаДатаПринятия.ТолькоПросмотр = Истина;
	КонецЕсли;
	Элементы["гкс_Ответственный"].Доступность = Не Объект.Статус = ЭтотОбъект["гкс_СтатусДляЗаписи"];
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ДобавитьТехКарту")
Процедура гкс_ДобавитьТехКарту(Команда)
	#Вставка
	Если ЭтотОбъект["гкс_ЭтоРодитель"] = Истина Тогда 
		Возврат;
	КонецЕсли;
	#КонецВставки

	ФормаВыбора = ПолучитьФорму("Справочник.торо_ИдентификаторыТехКарт.ФормаВыбора",Новый Структура("ДатаПринятия, ОтборПоСтатусам", ТехКарта.ДатаПринятия, ПредопределенноеЗначение("Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует")) , Элементы.СписокОпераций);
	ФормаВыбора.Открыть();

	НоваяСтрока = Истина;   		

КонецПроцедуры

&НаКлиенте
Процедура гкс_РодительПриИзмененииПосле(Элемент)
	ОбслуживаниеПриИзменении(Истина);
КонецПроцедуры

&НаСервере
Процедура гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// гкс+ [12.22] Деснол 13.12.2022
	//Если ЗначениеЗаполнено(Объект.Родитель) Тогда 
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	Родитель1.Родитель КАК Родитель,
	//		|	Родитель1.Ссылка КАК Ссылка
	//		|ИЗ
	//		|	Справочник.торо_ИдентификаторыТехКарт КАК торо_ИдентификаторыТехКарт
	//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ИдентификаторыТехКарт КАК Родитель1
	//		|		ПО торо_ИдентификаторыТехКарт.Родитель = Родитель1.Ссылка
	//		|ГДЕ
	//		|	торо_ИдентификаторыТехКарт.Ссылка = &Родитель
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|ВЫБРАТЬ
	//		|	гкс_ИерархияТехКарт.Родитель КАК Родитель
	//		|ИЗ
	//		|	РегистрСведений.гкс_ИерархияТехКарт КАК гкс_ИерархияТехКарт
	//		|ГДЕ
	//		|	гкс_ИерархияТехКарт.Подчиненный = &Ссылка";
	//	
	//	Запрос.УстановитьПараметр("Родитель", Объект.Родитель);
	//	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	//	РезультатЗапроса = Запрос.ВыполнитьПакет();
	//	Если РезультатЗапроса[0].Пустой() = Ложь Тогда 
	//		Выборка = РезультатЗапроса[0].Выбрать();
	//		Выборка.Следующий();
	//		Если Выборка.Родитель = Справочники.торо_ИдентификаторыТехКарт.ПустаяСсылка() Тогда 
	//			ЭтотОбъект["гкс_ЭтоРодитель"] = Истина;
	//			
	//			Элементы.Переместить(Элементы.ТехКартаДатаПринятия,Элементы["гкс_Группа_Обслуживание"]);
	//			Элементы.ГруппаНормаВремени.Видимость = Ложь;
	//		КонецЕсли;
	//	КонецЕсли;
	//	Если РезультатЗапроса[1].Пустой() = Ложь Тогда 
	//		ЭтотОбъект["гкс_ЭтоНаследник"] = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	// гкс- [12.22] Деснол 13.12.2022
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПередЗаписьюНаСервере")
Процедура гкс_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если Не УстановитьБлокировкуДанныхНаСервере(ТехКарта.Ссылка, ТехКарта.ВерсияДанных, Ложь)Тогда
		ТекстСообщения = НСтр("es='El objeto era cambiado o quitado. Vuelvan a leer los datos del objeto.';ru='Объект был изменен или удален. Перечитайте данные объекта.';en='The object has been modified or deleted. Reread the data of the object.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	Если НЕ ЗначениеЗаполнено(ТехКарта.ДатаПринятия) Тогда
		ТекстСообщения = НСтр("es='Campo ""De aquel. La tarjeta es aceptada con"" no es rellenado';ru='Поле ""Тех. карта принята с"" не заполнено';en='Field ""Technical card accepted from"" is not filled'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;

	#Удаление
	Если НЕ ЗначениеЗаполнено(ТехКарта.НормаВремени) Тогда
	#КонецУдаления
	#Вставка
	Если ЭтотОбъект["гкс_ЭтоРодитель"] = Ложь
		И НЕ ЗначениеЗаполнено(ТехКарта.НормаВремени) Тогда 
	#КонецВставки
		ТекстСообщения = НСтр("es='Campo ""la Duración"" no es rellenado';ru='Поле ""Продолжительность"" не заполнено';en='""Duration"" field is not filled'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.Статус) Тогда
		ТекстСообщения = НСтр("es='Campo ""el Estatus"" no es rellenado';ru='Поле ""Статус"" не заполнено';en='""Status"" field is not filled'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

	Для каждого СтрокаТаблицы Из ТехКарта.МатериальныеЗатраты Цикл

		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда

			ШаблонСообщения = НСтр("es='En la parte tabular ""los Gastos"" para la operación ""%1"": ¡no es rellenado el significado del requisito ""la Cantidad""!';ru='В табличной части ""Материальные затраты"" для операции ""%1"": Не заполнено значение реквизита ""Количество""!';en='In the tabular part ""Material costs"" for the operation ""%1"": The value of the attribute ""Quantity"" is not filled!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, СокрЛП(СтрокаТаблицы.Операция.Наименование));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);

		КонецЕсли;

	КонецЦикла;

	Для каждого СтрокаТаблицы Из ТехКарта.ИнструментыИТехника Цикл

		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда

			ШаблонСообщения = НСтр("es='En la parte tabular ""los Instrumentos y la técnica"" para la operación ""%1"": ¡no es rellenado el significado del requisito ""la Cantidad""!';ru='В табличной части ""Инструменты и техника"" для операции ""%1"": Не заполнено значение реквизита ""Количество""!';en='In the tabular section ""Tools and equipment"" for operation ""%1"": The value of the attribute ""Quantity"" is not filled!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, СокрЛП(СтрокаТаблицы.Операция.Наименование));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);

		КонецЕсли;

	КонецЦикла;
    #Вставка
	// Гкс+[TOIR20-503] Зозуля А.В. от 13.01.2025. Добавлено:{
	// Гкс+[TOIR20-541] Зозуля А.В. от 18.02.2025. Изменено:{
	//Для каждого СтрокаТаблицы Из ТехКарта.ИзмеряемыеПоказатели Цикл
	Для каждого СтрокаТаблицы Из ИзмеряемыеПоказатели Цикл
	// } Гкс-[TOIR20-541] Зозуля А.В. от 18.02.2025.	

		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.гкс_ТребуемыйРезультатИзмерения) Тогда

			ШаблонСообщения = НСтр("es='En la parte tabular ""Indicadores mensurables"" para la operación ""%1"": ¡no es rellenado el significado del requisito ""Resultado de medición requerido""!';
									|ru='В табличной части ""Измеряемые показатели"" для операции ""%1"": Не заполнено значение реквизита ""Требуемый результат измерения""!';
									|en='In the tabular section ""Measurable Indicators"" for operation ""%1"": The value of the attribute ""Required measurement result"" is not filled!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, СокрЛП(СтрокаТаблицы.Операция.Наименование));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);

		КонецЕсли;

	КонецЦикла;
	// } Гкс-[TOIR20-503] Зозуля А.В. от 13.01.2025.
	#КонецВставки
	Если Модифицированность И НЕ Отказ Тогда

		ПроверитьДругиеТехкарты = Истина;

		Если СоздаватьНовыйОбъект Тогда

			НовОбъект = Справочники.торо_ТехКарты.СоздатьЭлемент();

			ЗаполнитьЗначенияСвойств(НовОбъект, ТехКарта, , "Код");
			НовОбъект.Наименование = Объект.Наименование;

			НовОбъект.СписокОпераций.Загрузить(ТехКарта.СписокОпераций.Выгрузить());
			НовОбъект.ОказываемыеУслуги.Загрузить(ТехКарта.ОказываемыеУслуги.Выгрузить());
			НовОбъект.МатериальныеЗатраты.Загрузить(ТехКарта.МатериальныеЗатраты.Выгрузить());
			НовОбъект.ТрудовыеЗатраты.Загрузить(ТехКарта.ТрудовыеЗатраты.Выгрузить());
			НовОбъект.ИнструментыИТехника.Загрузить(ТехКарта.ИнструментыИТехника.Выгрузить());
			НовОбъект.ИзмеряемыеПоказатели.Загрузить(ТехКарта.ИзмеряемыеПоказатели.Выгрузить());
			НовОбъект.МерыБезопасности.Загрузить(ТехКарта.МерыБезопасности.Выгрузить());
			#Вставка
			// Гкс+[TOIR20-503] Зозуля А.В. от 13.01.2025. Добавлено:{
			НовОбъект.гкс_ИспытанияОборудования.Загрузить(ТехКарта.гкс_ИспытанияОборудования.Выгрузить());
			// } Гкс-[TOIR20-503] Зозуля А.В. от 13.01.2025.
			#КонецВставки

			ЗаписатьНормативыОпераций(НовОбъект);

			Если НовОбъект.ПроверитьЗаполнение() Тогда
				НовОбъект.Записать();
			Иначе
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			РаботаСФайламиСлужебный.СкопироватьПрисоединенныеФайлы(ПредВерсияТехКарты, НовОбъект.Ссылка);

			НаборЗаписей = РегистрыСведений.торо_ВерсииТехКарт.СоздатьНаборЗаписей();

			НС = НаборЗаписей.Добавить();
			НС.ИдентификаторТехКарты = торо_ОбщегоНазначения.ПолучитьСсылкуНаОбъект(ТекущийОбъект);
			НС.Период                = НовОбъект.ДатаПринятия;
			НС.ТехКарта              = НовОбъект.Ссылка;
			НаборЗаписей.Записать(Ложь);

			ТехКартаСсылка = ПолучитьТехКартуПоИдентификатору(НС.ИдентификаторТехКарты, НовОбъект.ДатаПринятия);

			ТехКартаОбъект = ТехКартаСсылка.ПолучитьОбъект();


			ЗаполнитьТаблицыЗначенийПоТабЧастям(ТехКартаОбъект.Ссылка);

			ЗначениеВРеквизитФормы(ТехКартаОбъект,"ТехКарта");

		Иначе

			ТехКартаОбъект = РеквизитФормыВЗначение("ТехКарта");
			ТехКартаОбъект.Наименование = Объект.Наименование;
			Если ТехКартаОбъект.ПроверитьЗаполнение() Тогда
				ТехКартаОбъект.Записать();
			Иначе
				Отказ = Истина;
				Возврат;
			КонецЕсли;

			Если ДатаПринятияИзменена Тогда

				МенеджерЗаписи = РегистрыСведений.торо_ВерсииТехКарт.СоздатьМенеджерЗаписи();

				МенеджерЗаписи.ИдентификаторТехКарты = торо_ОбщегоНазначения.ПолучитьСсылкуНаОбъект(ТекущийОбъект);
				МенеджерЗаписи.Период                = СтараяДатаПринятия;
				МенеджерЗаписи.ТехКарта              = ТехКартаОбъект.Ссылка;

				МенеджерЗаписи.Прочитать(); 

				МенеджерЗаписи.ТехКарта              = ТехКартаОбъект.Ссылка;
				МенеджерЗаписи.Период                = ТехКартаОбъект.ДатаПринятия;
				МенеджерЗаписи.ИдентификаторТехКарты = торо_ОбщегоНазначения.ПолучитьСсылкуНаОбъект(ТекущийОбъект);

				МенеджерЗаписи.Записать(Истина);

				СтараяДатаПринятия                   = ТехКартаОбъект.ДатаПринятия;

			КонецЕсли; 

			ЗначениеВРеквизитФормы(ТехКартаОбъект,"ТехКарта");

		КонецЕсли;
	КонецЕсли;

	#Вставка
	Если ЭтотОбъект["гкс_ЭтоРодитель"] = Ложь Тогда 
	#КонецВставки
	СообщитьОВозможномИзмененииПродолжительностиРемонта(флСписокОперацийМодифицированность, флТрудозатратыМодифицированность);
	#Вставка
	КонецЕсли;
	#КонецВставки

	Если НЕ Отказ Тогда
		флТрудозатратыМодифицированность = Ложь;
		флСписокОперацийМодифицированность = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("СтатусОбработкаВыбора")
Процедура гкс_СтатусОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(ТехКарта.ДатаПринятия) И ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует") Тогда
		СтандартнаяОбработка = Ложь;
		ТекстСообщения = НСтр("es='Campo ""De aquel. La tarjeta es aceptada con"" no es rellenado';ru='Поле ""Тех. карта принята с"" не заполнено';en='Field ""Technical card accepted from"" is not filled'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ТехКарта.НормаВремени)  И ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует") Тогда
		#Вставка
		Если ЭтотОбъект["гкс_ЭтоРодитель"] = Истина Тогда 
			ТехКарта.НормаВремени = 1;
		Иначе
		#КонецВставки
		СтандартнаяОбработка = Ложь;
		ТекстСообщения = НСтр("es='Campo ""la Duración"" no es rellenado';ru='Поле ""Продолжительность"" не заполнено';en='""Duration"" field is not filled'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		#Вставка
		КонецЕсли;
		#КонецВставки
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ИзменитьПодчиненнуюВерсиюТК(ПодчиненнаяТехКарта = Неопределено, ТехКартаСсылка)
	МассивИменТаблиц = Новый Массив();
	МассивИменТаблиц.Добавить("СписокОпераций");
	МассивИменТаблиц.Добавить("МатериальныеЗатраты");
	МассивИменТаблиц.Добавить("ТрудовыеЗатраты");
	МассивИменТаблиц.Добавить("ИнструментыИТехника");
	МассивИменТаблиц.Добавить("ИзмеряемыеПоказатели");
	МассивИменТаблиц.Добавить("ОказываемыеУслуги");
	МассивИменТаблиц.Добавить("МерыБезопасности");
	НеНайденныеТО = Новый Массив();
	Если ПодчиненнаяТехКарта = Неопределено Тогда 
		ПодчиненнаяТехКарта = ТехКартаСсылка.ПолучитьОбъект();
	КонецЕсли;
	Для Каждого ТехОперацияСтарая ИЗ ПодчиненнаяТехКарта.СписокОпераций Цикл
		НеНайденныеТО.Добавить(ТехОперацияСтарая.ID);
	КонецЦикла;
	Для Каждого ТехОперация ИЗ ТехКарта.СписокОпераций Цикл
		ЭтоНовая = Истина;
		Для Каждого ТехОперацияСтарая ИЗ ПодчиненнаяТехКарта.СписокОпераций Цикл
			Если ТехОперацияСтарая.ID = ТехОперация.ID Тогда 
				НеНайденныеТО.Удалить(НеНайденныеТО.Найти(ТехОперацияСтарая.ID));
				ЗаполнитьЗначенияСвойств(ТехОперацияСтарая, ТехОперация,,"Продолжительность,НормаВремениВСекундах");
				ЭтоНовая = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЭтоНовая Тогда 
			НоваяСтрока = ПодчиненнаяТехКарта.СписокОпераций.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТехОперация);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаМассива Из НеНайденныеТО Цикл
		Для Каждого ИмяТаблицы Из МассивИменТаблиц Цикл
			НайденныеСтроки = ПодчиненнаяТехКарта[ИмяТаблицы].НайтиСтроки(Новый Структура("ID", СтрокаМассива));
			Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
				ПодчиненнаяТехКарта[ИмяТаблицы].Удалить(СтрокаТЧ);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	НомерСтрокиНовый = 0;
	Для Каждого ТехОперация ИЗ ТехКарта.СписокОпераций Цикл
		НомерСтрокиСтарый = 0;
		Для Каждого ТехОперацияСтарая ИЗ ПодчиненнаяТехКарта.СписокОпераций Цикл
			Если ТехОперацияСтарая.ID = ТехОперация.ID Тогда 
				Прервать;
			КонецЕсли;
			НомерСтрокиСтарый = НомерСтрокиСтарый + 1;
		КонецЦикла;
		Если НЕ НомерСтрокиНовый = НомерСтрокиСтарый Тогда 
			ПодчиненнаяТехКарта.СписокОпераций.Сдвинуть(НомерСтрокиСтарый, НомерСтрокиНовый - НомерСтрокиСтарый);
		КонецЕсли;
		НомерСтрокиНовый = НомерСтрокиНовый + 1;
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ПодчиненнаяТехКарта, ТехКарта,, 
		"Код,ПометкаУдаления,Ссылка,НормаВремени,НормаВремениТекст,СпособРасчетаПродолжительности");
	ПодчиненнаяТехКарта.Записать();
	 	
КонецПроцедуры

&НаКлиенте
&После("СтатусПриИзменении")
Процедура Расш_гкс_СтатусПриИзменении(Элемент)
	Если Объект.Статус = ЭтотОбъект["гкс_СтатусДляЗаписи"] Тогда 
		ЭтотОбъект["гкс_ИзменитьТекущуюВерсию"] = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДатуОкончанияАктуальностиКарты()
	
	Если ЗначениеЗаполнено(ТехКарта.ДатаПринятия) 
		И ЗначениеЗаполнено(ТехКарта.гкс_ПериодДействия) Тогда
		КолВоПериодов = ?(ТехКарта.гкс_КоличествоПериодовДействия = 0, 1, ТехКарта.гкс_КоличествоПериодовДействия);
		ТехКарта.гкс_ДатаОкончанияАктуальности = 		
			торо_ОбщегоНазначенияКлиентСервер.РассчитатьДатуОкончанияПериода(ТехКарта.ДатаПринятия, 
																			 ТехКарта.гкс_ПериодДействия, 
																			 КолВоПериодов);
	Иначе
		ТехКарта.гкс_ДатаОкончанияАктуальности = Неопределено;
	КонецЕсли;                                                               	
	
КонецПроцедуры

&НаСервере
Процедура гкс_КомандаИсторияДанныхПослеНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура гкс_КомандаИсторияДанныхПосле(Команда)
	ИдентификаторТехКарты = Объект.Ссылка;
	ТехнологическаяКарта = ТехКартаПоИдентификатору(ИдентификаторТехКарты);
	Если ЗначениеЗаполнено(ТехнологическаяКарта) Тогда
		// гкс+ [03.23] Деснол 13.03.2023
		//Отбор = Новый Структура("Data", ТехнологическаяКарта); 				
		//ОткрытьФорму("sysForm:DataHistoryVersions", Отбор, ЭтаФорма, , , , ,
		//	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ссылка", ТехнологическаяКарта);
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
		
		ОткрытьФорму("РегистрСведений.ВерсииОбъектов.Форма.ВыборХранимыхВерсий",
								ПараметрыФормы,);
		// гкс- [03.23] Деснол 13.03.2023
	КонецЕсли; 
КонецПроцедуры

// Гкс+[TOIR20-109] Селимов от 02.06.2020. Добавлено:{
&НаСервере
Функция ТехКартаПоИдентификатору(ИдентификаторТехКарты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ВерсииТехКартСрезПоследних.ТехКарта КАК ТехКарта
		|ИЗ
		|	РегистрСведений.торо_ВерсииТехКарт.СрезПоследних КАК торо_ВерсииТехКартСрезПоследних
		|ГДЕ
		|	торо_ВерсииТехКартСрезПоследних.ИдентификаторТехКарты = &ИдентификаторТехКарты";
	
	Запрос.УстановитьПараметр("ИдентификаторТехКарты", ИдентификаторТехКарты);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.ТехКарта;	
	
КонецФункции // } Гкс-[TOIR20-109] 

&НаКлиенте
Процедура гкс_гкс_ПередЗаписьюПередПеред(Отказ, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
КонецПроцедуры

// гкс+ [03.23] Деснол 21.03.2023
&НаКлиенте
Процедура гкс_ОбновитьИзОпераций(Команда)
	ОпОп = Новый ОписаниеОповещения("гкс_ОбновитьИзОперацийПослеВопроса", ЭтотОбъект);
	ПоказатьВопрос(ОпОп, "Таблицы затрат будут перезаполнены из операций. Продолжить?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры // гкс- [03.23] Деснол 21.03.2023

// гкс+ [03.23] Деснол 21.03.2023
&НаКлиенте
Процедура гкс_ОбновитьИзОперацийПослеВопроса(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		гкс_ОбновитьИзОперацийНаСервере();
		СписокОперацийПриАктивизацииСтроки(Элементы.СписокОпераций);
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры // гкс- [03.23] Деснол 21.03.2023

// гкс+ [03.23] Деснол 21.03.2023
&НаСервере
Процедура гкс_ОбновитьИзОперацийНаСервере()
	ТехКарта.МатериальныеЗатраты.Очистить();
	ТехКарта.ТрудовыеЗатраты.Очистить();
	ТехКарта.ИнструментыИТехника.Очистить();
	//
	Для Каждого СтрокаО Из ТехКарта.СписокОпераций Цикл
		Если ЗначениеЗаполнено(СтрокаО.Операция) Тогда 
			ОбъектТО = СтрокаО.Операция.ПолучитьОбъект();
			Для Каждого СТ Из ОбъектТО.МатериальныеЗатраты Цикл
				НоваяСтрока = ТехКарта.МатериальныеЗатраты.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СТ);
				НоваяСтрока.ID = СтрокаО.ID;
				НоваяСтрока.Операция = СтрокаО.Операция;
			КонецЦикла;
			Для Каждого СТ Из ОбъектТО.ТрудовыеЗатраты Цикл
				НоваяСтрока = ТехКарта.ТрудовыеЗатраты.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СТ);
				НоваяСтрока.ID = СтрокаО.ID;
				НоваяСтрока.Операция = СтрокаО.Операция;
			КонецЦикла;
			Для Каждого СТ Из ОбъектТО.ИнструментыИТехника Цикл
				НоваяСтрока = ТехКарта.ИнструментыИТехника.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СТ);
				НоваяСтрока.ID = СтрокаО.ID;
				НоваяСтрока.Операция = СтрокаО.Операция;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // гкс- [03.23] Деснол 21.03.2023

&НаСервере
&ИзменениеИКонтроль("УстановитьОтборыТаблицНормативов")
Процедура гкс_УстановитьОтборыТаблицНормативов(ID, Операция)

	мСтруктураТабличныхЧастейНормативов = Новый Структура();
	мСтруктураТабличныхЧастейНормативов.Вставить("МатериальныеЗатраты" , "тзМатериальныеЗатратыРемонтов");	
	мСтруктураТабличныхЧастейНормативов.Вставить("ТрудовыеЗатраты"     , "тзТрудовыеЗатратыРемонтов");
	мСтруктураТабличныхЧастейНормативов.Вставить("ИнструментыИТехника" , "тзИнструментыИТехникаРемонтов");
	мСтруктураТабличныхЧастейНормативов.Вставить("ИзмеряемыеПоказатели", "тзИзмеряемыеПоказателиРемонтов");
	мСтруктураТабличныхЧастейНормативов.Вставить("ОказываемыеУслуги"   , "тзОказываемыхУслугРемонтов");
	мСтруктураТабличныхЧастейНормативов.Вставить("МерыБезопасности", "тзМерыБезопасностиРемонтов");
	#Вставка
	// Гкс+[TOIR20-503] Зозуля А.В. от 13.01.2025. Добавлено:{
	мСтруктураТабличныхЧастейНормативов.Вставить("гкс_ИспытанияОборудования", "тзгкс_ИспытанияОборудования");
	// } Гкс-[TOIR20-503] Зозуля А.В. от 13.01.2025.
	#КонецВставки

	Для Каждого КлючИЗначение Из мСтруктураТабличныхЧастейНормативов Цикл

		Если Не ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
			Элементы[КлючИЗначение.Ключ].ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("ID", ID));
		Иначе
			Если ТипЗнч(Операция) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
				ЭтаФорма[КлючИЗначение.Ключ].Загрузить(ЭтаФорма[КлючИЗначение.Значение].Выгрузить(Новый Структура("ID", ID)));	
				Элементы[КлючИЗначение.Ключ].ЦветТекста = Новый Цвет(128,128,128);
			Иначе
				ЭтаФорма[КлючИЗначение.Ключ].Загрузить(ТехКарта[КлючИЗначение.Ключ].Выгрузить(Новый Структура("ID", ID)));
				Элементы[КлючИЗначение.Ключ].ЦветТекста = Новый Цвет(51,51,51);
			КонецЕсли;	
		КонецЕсли;

	КонецЦикла;

	Для каждого Стр Из ТрудовыеЗатраты Цикл
		Стр.ВремяРаботыТекст = СформироватьПродолжительность(Стр.ВремяРаботы);
	КонецЦикла;

	Для каждого Стр Из ИнструментыИТехника Цикл
		Стр.ВремяРаботыТекст = СформироватьПродолжительность(Стр.ВремяРаботы);
	КонецЦикла;
	СлужебныеРеквизитыЗаполнитьНаСервере();

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("СоздатьНовуюВерсиюТехкарты")
Процедура гкс_СоздатьНовуюВерсиюТехкарты1(Знач ЗаполнитьТаблицы, Знач ТехКартаОбъект, Знач Копирование)

	ПредВерсияТехКарты = ТехКарта.Ссылка;
	Если ЗаполнитьТаблицы Тогда
		ТехКартаОбъект = ?(ТехКартаОбъект = Неопределено, РеквизитФормыВЗначение("ТехКарта").Скопировать(), ТехКартаОбъект);
		Объект.Статус = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.ВРазработке;
	Иначе
		ТехКартаОбъект = Справочники.торо_ТехКарты.СоздатьЭлемент();
	КонецЕсли; 

	ЗначениеВРеквизитФормы(ТехКартаОбъект,"ТехКарта");

	СоздаватьНовыйОбъект                      = Истина;
	Элементы.ТехКартаДатаПринятия.Доступность = Истина;
	Элементы.Изменить.Доступность             = Ложь;
	ТехКарта.ДатаПринятия                     = Дата("00010101");
	СтараяДатаПринятия                        = Дата("00010101");

	мСтруктураТабличныхЧастейНормативов = Новый Структура();
	мСтруктураТабличныхЧастейНормативов.Вставить("МатериальныеЗатраты" , тзМатериальныеЗатратыРемонтов);	
	мСтруктураТабличныхЧастейНормативов.Вставить("ТрудовыеЗатраты"     , тзТрудовыеЗатратыРемонтов);
	мСтруктураТабличныхЧастейНормативов.Вставить("ИнструментыИТехника" , тзИнструментыИТехникаРемонтов);
	мСтруктураТабличныхЧастейНормативов.Вставить("ИзмеряемыеПоказатели", тзИзмеряемыеПоказателиРемонтов);
	мСтруктураТабличныхЧастейНормативов.Вставить("МерыБезопасности"    , тзМерыБезопасностиРемонтов);
	мСтруктураТабличныхЧастейНормативов.Вставить("ОказываемыеУслуги"    , тзОказываемыхУслугРемонтов);
	#Вставка
	// Гкс+[TOIR20-545] Зозуля А.В. от 24.02.2025. Добавлено:{
	мСтруктураТабличныхЧастейНормативов.Вставить("гкс_ИспытанияОборудования"    , ЭтотОбъект["тзгкс_ИспытанияОборудования"]);
	// } Гкс-[TOIR20-545] Зозуля А.В. от 24.02.2025.
	#КонецВставки

	Если ЗаполнитьТаблицы Тогда
		Если Копирование Тогда
			СоответствиеСтарыхИНовыхID = Новый Соответствие;
		КонецЕсли;
		Для Каждого КлючИЗначение Из мСтруктураТабличныхЧастейНормативов Цикл // Для каждой табличной части

			Для каждого Строка Из Техкарта.СписокОпераций Цикл          // по каждой операции Из техкарты

				Если Копирование Тогда
					НовыйIDСтроки = СоответствиеСтарыхИНовыхID[Строка.ID];
					Если НовыйIDСтроки = Неопределено Тогда
						НовыйIDСтроки = Строка(Новый УникальныйИдентификатор);
						СоответствиеСтарыхИНовыхID.Вставить(Строка.ID, НовыйIDСтроки);						
					КонецЕсли;
				Иначе
					НовыйIDСтроки = Строка.ID;
				КонецЕсли;

				Если ТипЗнч(Строка.Операция) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда

					МассивСтрокКУдалению = Техкарта[КлючИЗначение.Ключ].НайтиСтроки(Новый Структура("ID",Строка.ID));

					Для каждого СтрокаКУдалению Из МассивСтрокКУдалению Цикл
						Техкарта[КлючИЗначение.Ключ].Удалить(СтрокаКУдалению);
					КонецЦикла;

					МассивСтрокКДобавлению = КлючИЗначение.Значение.НайтиСтроки(Новый Структура("ID",Строка.ID));

					Для каждого СтрокаКДобавлению Из МассивСтрокКДобавлению Цикл
						НС = Техкарта[КлючИЗначение.Ключ].Добавить();
						ЗаполнитьЗначенияСвойств(НС,СтрокаКДобавлению);
						НС.ID = Строка.ID;
					КонецЦикла; 

				Иначе
					МассивСтрокКИзменению = Техкарта[КлючИЗначение.Ключ].НайтиСтроки(Новый Структура("ID",Строка.ID));
					Для каждого СтрокаКИзменениюID Из МассивСтрокКИзменению Цикл					
						СтрокаКИзменениюID.ID = НовыйIDСтроки;					
					КонецЦикла;
				КонецЕсли;
			КонецЦикла; 										
		КонецЦикла;
		Если Копирование Тогда
			Для каждого Строка Из Техкарта.СписокОпераций Цикл			
				НовыйIDСтроки = СоответствиеСтарыхИНовыхID[Строка.ID];
				Если НовыйIDСтроки = Неопределено Тогда
					НовыйIDСтроки = Строка(Новый УникальныйИдентификатор);
					СоответствиеСтарыхИНовыхID.Вставить(Строка.ID, НовыйIDСтроки);						
				КонецЕсли;
				Строка.ID = НовыйIDСтроки;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	Для каждого Стр Из ТехКарта.СписокОпераций Цикл

		Стр.ПродолжительностьТекст = СформироватьПродолжительность(Стр.НормаВремениВСекундах);
		Стр.Картинка               = ?(ТипЗнч(Стр.Операция) = Тип("СправочникСсылка.торо_ТехнологическиеОперации"),2,0);

	КонецЦикла;
	СлужебныеРеквизитыЗаполнитьНаСервере();

КонецПроцедуры

// Гкс+[TOIR20-622] Оселедько В.С. от 25.07.2025. Добавлено:{
&НаСервереБезКонтекста
Процедура ЗавершитьЗамерОткрытияФормы(ВремяНачалаЗамера)
	
    ОценкаПроизводительности.ЗакончитьЗамерВремени("Справочник.торо_ИдентификаторыТехКарт.ОткрытиеФормы", ВремяНачалаЗамера); 
	
КонецПроцедуры // } Гкс-[TOIR20-622]

#КонецОбласти
